agency-services-transunion/src/examples/lastreq.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
  xmlns:tns="https://consumerconnectws.tui.transunion.com/"
  xmlns:http="http://schemas.microsoft.com/ws/06/2004/policy/http"
  xmlns:q1="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q2="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q3="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q4="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q5="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q6="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q7="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q8="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q9="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q10="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q11="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q12="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q13="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q14="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q15="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q16="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q17="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q18="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q19="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q20="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q21="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q22="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q23="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q24="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q25="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q26="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q27="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q28="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q29="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q30="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q31="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q32="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q33="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q34="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q35="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q36="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q37="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q38="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q39="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q40="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q41="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q42="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q43="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q44="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q45="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q46="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q47="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q48="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q49="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q50="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q51="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q52="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q53="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q54="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q55="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q56="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q57="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q58="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q59="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q60="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q61="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q62="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q63="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q64="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q65="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q66="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q67="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q68="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q69="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q70="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q71="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q72="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q73="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q74="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q75="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q76="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q77="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q78="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q79="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q80="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q81="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q82="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q83="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q84="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q85="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q86="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q87="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q88="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q89="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q90="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q91="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q92="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q93="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q94="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q95="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q96="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q97="https://consumerconnectws.tui.transunion.com/data"
  xmlns:q98="https://consumerconnectws.tui.transunion.com/data">
  <soap:Header></soap:Header>
  <soap:Body>
    <IndicativeEnrichment xmlns="https://consumerconnectws.tui.transunion.com/">
      <AccountCode>Q0NJdGtkQThtR3hwaQ</AccountCode>
      <AccountName>CC2BraveCredit</AccountName>
      <RequestKey>d75ea1f3-b190-411c-af8c-723c0a242f99</RequestKey>
      <ClientKey>6b0fe15e-22f0-4797-8087-eaf2d17106ca</ClientKey>
      <Customer>
        <CurrentAddress>
          <AddressLine1>2409 Vandever  Ave</AddressLine1>
          <City>HOLLYWOOD</City>
          <State>FL</State>
          <Zipcode>33025</Zipcode>
        </CurrentAddress>
        <DateOfBirth>1957-09-01</DateOfBirth>
        <FullName>
          <FirstName>AARON</FirstName>
          <LastName>TESTA</LastName>
        </FullName>
        <Ssn>899010001</Ssn>
      </Customer>
      <ServiceBundleCode>CC2BraveCreditIndicativeEnrichment</ServiceBundleCode>
    </IndicativeEnrichment>
  </soap:Body>
</soap:Envelope>